CREATE TABLE Students (
    ID INT PRIMARY KEY,
    Surname VARCHAR(100),
    Subject VARCHAR(100),
    School VARCHAR(100),
    Sum DECIMAL(4, 1)
);

INSERT INTO Students (ID, Surname, Subject, School, Sum) VALUES
(1, 'Иванова', 'Математика', 'Лицей', 98.5),
(2, 'Петров', 'Физика', 'Лицей', 99.0),
(3, 'Сидоров', 'Математика', 'Лицей', 88.0),
(4, 'Полухина', 'Физика', 'Гимназия', 78.0),
(5, 'Матвеева', 'Химия', 'Лицей', 92.0),
(6, 'Касимов', 'Химия', 'Гимназия', 68.0),
(7, 'Нурулин', 'Математика', 'Гимназия', 81.0),
(8, 'Авдеев', 'Физика', 'Лицей', 87.0),
(9, 'Никитина', 'Химия', 'Лицей', 94.0),
(10, 'Барышева', 'Химия', 'Лицей', 88.0);
