CREATE TABLE Employee (
    Tab_Number INT,
    Code VARCHAR(10),
    Professor_Name NVARCHAR(255),
    Position NVARCHAR(100),
    Salary INT,
    Chief INT
);

INSERT INTO Employee (Tab_Number, Code, Professor_Name, Position, Salary, Chief)
VALUES
    (101, 'пи', 'Прохоров П.П.', 'зав.кафедрой', 35000, 101),
    (102, 'пи', 'Семенов С.С.', 'преподаватель', 25000, 101),
    (105, 'пи', 'Петров П.П.', 'преподаватель', 25000, 101),
    (153, 'пи', 'Сидорова С.С.', 'инженер', 15000, 102),
    (201, 'ис', 'Андреев А.А.', 'зав.кафедрой', 35000, 201),
    (202, 'ис', 'Борисов Б.Б.', 'преподаватель', 25000, 201),
    (241, 'ис', 'Глухов Г.Г.', 'инженер', 20000, 201),
    (242, 'ис', 'Чернов Ч.Ч.', 'инженер', 15000, 202),
    (301, 'мм', 'Басов Б.Б.', 'зав.кафедрой', 35000, 301),
    (302, 'мм', 'Сергеева С.С.', 'преподаватель', 25000, 301),
    (401, 'оф', 'Волков В.В.', 'зав.кафедрой', 35000, 401),
    (402, 'оф', 'Зайцев З.З.', 'преподаватель', 25000, 401),
    (403, 'оф', 'Смирнов С.С.', 'преподаватель', 15000, 401),
    (435, 'оф', 'Лисин Л.Л.', 'инженер', 20000, 402),
    (501, 'вм', 'Кузнецов К.К.', 'зав.кафедрой', 35000, 501),
    (502, 'вм', 'Романцев Р.Р.', 'преподаватель', 25000, 501),
    (503, 'вм', 'Соловьев С.С.', 'преподаватель', 25000, 501),
    (601, 'эф', 'Зверев З.З.', 'зав.кафедрой', 35000, 601),
    (602, 'эф', 'Сорокина С.С.', 'преподаватель', 25000, 601),
    (614, 'эф', 'Григорьев Г.Г.', 'инженер', 20000, 602);
