CREATE TABLE Prof (
    Tab_Number INT PRIMARY KEY, 
    Rank NVARCHAR(100),         
    Degree NVARCHAR(100)       
);

INSERT INTO Prof (Tab_Number, Rank, Degree)
VALUES
    (101, 'профессор', 'д.т.н.'),
    (102, 'доцент', 'к.ф.-м.н.'),
    (105, 'доцент', 'к.т.н.'),
    (201, 'профессор', 'д.ф.-м.н.'),
    (202, 'доцент', 'к.ф.-м.н.'),
    (301, 'профессор', 'д.т.н.'),
    (302, 'доцент', 'к.т.н.'),
    (401, 'профессор', 'д.т.н.'),
    (402, 'доцент', 'к.т.н.'),
    (403, 'ассистент', '–'),
    (501, 'профессор', 'д.ф.-м.н.'),
    (502, 'профессор', 'д.ф.-м.н.'),
    (503, 'доцент', 'к.ф.-м.н.'),
    (601, 'профессор', 'д.ф.-м.н.');
